<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1,3,736,1280" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input.1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="293" type="Const" version="opset1">
			<data element_type="f32" shape="64, 3, 3, 3" offset="0" size="6912"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="293"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="293">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Convolution_55" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_55"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Reshape_75" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="6912" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="292" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="292, Concat_74, Reshape_75"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="292">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="157" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="157"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="157">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="296" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="7168" size="147456"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="296"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="296">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Convolution_104" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_104"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_124" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="154624" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="295" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="295, Concat_123, Reshape_124"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="295">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="160" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="160"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="160">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="161" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="161"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>736</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="161">
					<dim>1</dim>
					<dim>64</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="299" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="154880" size="294912"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="299"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="299">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Convolution_154" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_154"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_174" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="449792" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="298" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="298, Concat_173, Reshape_174"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="298">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="164" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="164"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="164">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="302" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="450304" size="589824"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="302"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="302">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Convolution_203" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_203"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_223" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1040128" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="301" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="301, Concat_222, Reshape_223"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="301">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="167" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="167"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="167">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="168" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="168"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>368</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="168">
					<dim>1</dim>
					<dim>128</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="305" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="1040640" size="1179648"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="305"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="305">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Convolution_253" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_253"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_273" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="2220288" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="304" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="304, Concat_272, Reshape_273"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="304">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="171" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="171"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="171">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="308" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3, 3" offset="2221312" size="2359296"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="308"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="308">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Convolution_302" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_302"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_322" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="4580608" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="307" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="307, Concat_321, Reshape_322"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="307">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="174" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="174"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="174">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="311" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3, 3" offset="4581632" size="2359296"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="311"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="311">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Convolution_351" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_351"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_371" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="6940928" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="310" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="310, Concat_370, Reshape_371"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="310">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="177" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="177"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="177">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="178" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="178"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>184</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="178">
					<dim>1</dim>
					<dim>256</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="314" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 3, 3" offset="6941952" size="4718592"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="314"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="314">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Convolution_401" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_401"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Reshape_421" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="11660544" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="313" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="313, Concat_420, Reshape_421"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="313">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="181" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="181"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="181">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="317" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 3, 3" offset="11662592" size="9437184"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="317"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="317">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Convolution_450" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_450"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Reshape_470" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="21099776" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="316" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="316, Concat_469, Reshape_470"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="316">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="184" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="184"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="184">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="320" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 3, 3" offset="21101824" size="9437184"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="320"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="320">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Convolution_499" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_499"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Reshape_519" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="30539008" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="319" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="319, Concat_518, Reshape_519"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="319">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="187" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="187"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="187">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="188" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="188"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="188">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="323" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 3, 3" offset="30541056" size="9437184"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="323"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="323">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Convolution_549" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_549"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_569" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="39978240" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="322" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="322, Concat_568, Reshape_569"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="322">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="191" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="191"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="191">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="326" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 3, 3" offset="39980288" size="9437184"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="326"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="326">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Convolution_598" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_598"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_618" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="49417472" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="325" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="325, Concat_617, Reshape_618"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="325">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="194" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" kernel="3, 3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="194"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="194">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="basenet.slice5.1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 512, 3, 3" offset="49419520" size="18874368"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="basenet.slice5.1.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="basenet.slice5.1.weight">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Convolution_647" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="6, 6" pads_begin="6, 6" pads_end="6, 6" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="195, Concat_666, Convolution_647, Reshape_667"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="195">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="basenet.slice5.2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 1024, 1, 1" offset="68293888" size="4194304"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="basenet.slice5.2.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="basenet.slice5.2.weight">
					<dim>1024</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Convolution_695" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="196, Concat_714, Convolution_695, Reshape_715"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="196">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="197" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="197"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="197">
					<dim>1</dim>
					<dim>1536</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="329" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1536, 1, 1" offset="72488192" size="3145728"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="329"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="329">
					<dim>512</dim>
					<dim>1536</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Convolution_744" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="328, Concat_763, Convolution_744, Reshape_764"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1536</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1536</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="328">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="200" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="200"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="200">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="332" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512, 3, 3" offset="75633920" size="4718592"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="332"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="332">
					<dim>256</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Convolution_793" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="331, Concat_812, Convolution_793, Reshape_813"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="331">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="203" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="203"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="203">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="213" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="213, ShapeOf_884"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="213">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="215" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="80352512" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="214, 215, 216, 217, Broadcast_861, ShapeOf_860"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="215">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="216" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="80352520" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="214, 215, 216, 217, Broadcast_861, ShapeOf_860"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="216">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Broadcast_861" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="80352528" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="214, 215, 216, 217, Broadcast_861, ShapeOf_860"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="217" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="214, 215, 216, 217, Broadcast_861, ShapeOf_860"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="217">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="204" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="204, 207"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="204,207">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_4813" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="80352536" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="212"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_4814" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="80352512" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="84" name="Gather_4815" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="212, 218"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="212,218">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="219" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="219"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="219">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Convert_886" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_886"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Convert_885" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_885"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Divide_887" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Divide_887"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_5498" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="80352552" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Add_889" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_889"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="222" type="Interpolate" version="opset4">
			<data mode="linear_onnx" shape_calculation_mode="sizes" coordinate_transformation_mode="pytorch_half_pixel" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="222"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>46</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="222">
					<dim>1</dim>
					<dim>256</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="223" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="223"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="223">
					<dim>1</dim>
					<dim>768</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="335" type="Const" version="opset1">
			<data element_type="f32" shape="256, 768, 1, 1" offset="80352556" size="786432"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="335"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="335">
					<dim>256</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Convolution_967" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="334, Concat_986, Convolution_967, Reshape_987"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="334">
					<dim>1</dim>
					<dim>256</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="226" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="226"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="226">
					<dim>1</dim>
					<dim>256</dim>
					<dim>92</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="338" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256, 3, 3" offset="81138988" size="1179648"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="338"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="338">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Convolution_1016" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="337, Concat_1035, Convolution_1016, Reshape_1036"/>
			</rt_info>
			<input>
